mra-wrapper/SENT.log

POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope>POST / HTTP/1.1
Host: localhost:8020
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 151
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST / HTTP/1.1
Host: localhost:8020
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 151
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2020</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope>POST / HTTP/1.1
Host: localhost:8020
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 151
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST / HTTP/1.1
Host: localhost:8020
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 151
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2020</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope>POST / HTTP/1.1
Host: localhost:8020
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 151
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST / HTTP/1.1
Host: localhost:8020
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 151
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2020</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>POST /ACSFC/services/LookupComponent HTTP/1.1
Host: localhost:8180
User-Agent: gSOAP/2.7
Content-Type: text/xml; charset=utf-8
Content-Length: 576
Connection: close
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://registrationcomponent" xmlns:ns2="urn:trg_producer" xmlns:ns7="http://lookupcomponent"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><ns7:lookupURI><nameToResolve>an1.TRG.Producer</nameToResolve></ns7:lookupURI></SOAP-ENV:Body></SOAP-ENV:Envelope><?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope><SOAP-ENV:Body><ns2:register><id>2021</id></ns2:register></SOAP-ENV:Body></SOAP-ENV:Envelope>